CHwndRenderTarget.m_pHwndRenderTarget
A pointer to an ID2D1HwndRenderTarget object.

CHwndRenderTarget.Resize(CD2DSizeU!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Changes the size of the render target to the specified pixel size
Returns: If the method succeeds, it returns TRUE. Otherwise, it returns FALSE.
size: The new size of the render target in device pixels

CHwndRenderTarget.CheckWindowState
Indicates whether the HWND associated with this render target is occluded.
Returns:
A value that indicates whether the HWND associated with this render target is occluded.

CHwndRenderTarget.GetHwnd
Returns the HWND associated with this render target.
Returns:
The HWND associated with this render target.

CHwndRenderTarget.op_Implicit~ID2D1HwndRenderTarget*
Returns ID2D1HwndRenderTarget interface.
Returns:
Pointer to an ID2D1HwndRenderTarget interface or NULL if object is not initialized yet.

CHwndRenderTarget.GetHwndRenderTarget
Returns ID2D1HwndRenderTarget interface.
Returns:
Pointer to an ID2D1HwndRenderTarget interface or NULL if object is not initialized yet.

CHwndRenderTarget.ReCreate(HWND__*)
Re-creates a render target associated with the window
Returns: If the method succeeds, it returns TRUE. Otherwise, it returns FALSE.
hWnd: The HWND associated with this render target

CHwndRenderTarget.Create(HWND__*)
Creates a render target associated with the window
Returns: If the method succeeds, it returns TRUE. Otherwise, it returns FALSE
hWnd: The HWND associated with this render target

CHwndRenderTarget.Detach
Detaches render target interface from the object
Returns:
Pointer to detached render target interface.

CHwndRenderTarget.Attach(ID2D1HwndRenderTarget*)
Attaches existing render target interface to the object
pTarget: Existing render target interface. Cannot be NULL

CHwndRenderTarget.#ctor(HWND__*)
Constructs a CHwndRenderTarget object from HWND.
hwnd: The HWND associated with this render target

CHwndRenderTarget
ID2D1HwndRenderTarget wrapper.